; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v2 - type_3 ?v5 - type_2)
 	      (pred_1 ?v4 - object ?v5 - type_2)
	      (pred_4 ?v2 - type_3 ?v1 - type_1)
	      (pred_2 ?v2 - type_3 ?v4 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v2 - type_3 ?v6 ?v8 - type_2)
       :precondition (and  (pred_3 ?v2 ?v6))
       :effect (and  (pred_3 ?v2 ?v8)
		     (not (pred_3 ?v2 ?v6))))

   (:action op_3
       :parameters (?v2 - type_3 ?v7 - object ?v3 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v3) (pred_3 ?v2 ?v3) (pred_4 ?v2 ?v1))
       :effect (and (pred_2 ?v2 ?v7 ?v1)
		    (not (pred_1 ?v7 ?v3)) 
		    (not (pred_4 ?v2 ?v1))))

   (:action op_1
       :parameters (?v2 - type_3 ?v7 - object ?v3 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v7 ?v1) (pred_3 ?v2 ?v3))
       :effect (and (pred_1 ?v7 ?v3)
		    (pred_4 ?v2 ?v1)
		    (not (pred_2 ?v2 ?v7 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_03 obj_07 - type_3
obj_12 obj_04 obj_08 obj_09 - type_1
obj_11 obj_06 obj_14 obj_01 - type_2
obj_13 obj_10 obj_05 obj_02 - object)
(:init
(pred_3 obj_03 obj_14)
(pred_4 obj_03 obj_12)
(pred_4 obj_03 obj_04)
(pred_3 obj_07 obj_06)
(pred_4 obj_07 obj_08)
(pred_4 obj_07 obj_09)
(pred_1 obj_13 obj_06)
(pred_1 obj_10 obj_06)
(pred_1 obj_05 obj_11)
(pred_1 obj_02 obj_01)
)
(:goal
(and
(pred_1 obj_13 obj_06)
(pred_1 obj_10 obj_14)
(pred_1 obj_05 obj_01)
(pred_1 obj_02 obj_06)
)
)

(:constraints
  (always (not (pred_3 obj_03 obj_01)))
)
)

; plan
1. (op_2 obj_03 obj_14 obj_11)
   deleted: (pred_3 obj_03 obj_14)
   added: (pred_3 obj_03 obj_11)
   goals met: 1 of 4
2. (op_3 obj_07 obj_10 obj_06 obj_09)
   deleted: (pred_1 obj_10 obj_06) (pred_4 obj_07 obj_09)
   added: (pred_2 obj_07 obj_10 obj_09)
   goals met: 1 of 4
3. (op_2 obj_07 obj_06 obj_14)
   deleted: (pred_3 obj_07 obj_06)
   added: (pred_3 obj_07 obj_14)
   goals met: 1 of 4
4. (op_3 obj_03 obj_05 obj_11 obj_04)
   deleted: (pred_1 obj_05 obj_11) (pred_4 obj_03 obj_04)
   added: (pred_2 obj_03 obj_05 obj_04)
   goals met: 1 of 4
5. (op_1 obj_07 obj_10 obj_14 obj_09)
   deleted: (pred_2 obj_07 obj_10 obj_09)
   added: (pred_1 obj_10 obj_14) (pred_4 obj_07 obj_09)
   goals met: 2 of 4
6. (op_2 obj_03 obj_11 obj_06)
   deleted: (pred_3 obj_03 obj_11)
   added: (pred_3 obj_03 obj_06)
   goals met: 2 of 4
7. (op_2 obj_07 obj_14 obj_11)
   deleted: (pred_3 obj_07 obj_14)
   added: (pred_3 obj_07 obj_11)
   goals met: 2 of 4
8. (op_1 obj_03 obj_05 obj_06 obj_04)
   deleted: (pred_2 obj_03 obj_05 obj_04)
   added: (pred_1 obj_05 obj_06) (pred_4 obj_03 obj_04)
   goals met: 2 of 4
9. (op_2 obj_07 obj_11 obj_01)
   deleted: (pred_3 obj_07 obj_11)
   added: (pred_3 obj_07 obj_01)
   goals met: 2 of 4
10. (op_3 obj_07 obj_02 obj_01 obj_09)
   deleted: (pred_1 obj_02 obj_01) (pred_4 obj_07 obj_09)
   added: (pred_2 obj_07 obj_02 obj_09)
   goals met: 2 of 4
11. (op_2 obj_07 obj_01 obj_06)
   deleted: (pred_3 obj_07 obj_01)
   added: (pred_3 obj_07 obj_06)
   goals met: 2 of 4
12. (op_1 obj_07 obj_02 obj_06 obj_09)
   deleted: (pred_2 obj_07 obj_02 obj_09)
   added: (pred_1 obj_02 obj_06) (pred_4 obj_07 obj_09)
   goals met: 3 of 4
13. (op_3 obj_07 obj_05 obj_06 obj_09)
   deleted: (pred_1 obj_05 obj_06) (pred_4 obj_07 obj_09)
   added: (pred_2 obj_07 obj_05 obj_09)
   goals met: 3 of 4
14. (op_2 obj_07 obj_06 obj_01)
   deleted: (pred_3 obj_07 obj_06)
   added: (pred_3 obj_07 obj_01)
   goals met: 3 of 4
15. (op_1 obj_07 obj_05 obj_01 obj_09)
   deleted: (pred_2 obj_07 obj_05 obj_09)
   added: (pred_1 obj_05 obj_01) (pred_4 obj_07 obj_09)
   goals met: 4 of 4
